Tekla Open API Reference for Tekla Structures 2025
WeldGeometry.Position Property
 Gets the weld seam position (above or below).
 Namespace: Tekla.Structures.Model.Welding
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WeldSeamPositionEnum Position { get; }
Public ReadOnly Property Position As WeldSeamPositionEnum
	Get
Property Value
Type: WeldSeamPositionEnum
See Also
Reference
WeldGeometry Class
Tekla.Structures.Model.Welding Namespace